import pandas as pd

# Зчитування даних з файлу
df = pd.read_csv("students.csv")

# Обчислення середнього балу кожного студента
df["Середній бал"] = df[
    ["Мат.ан.", "Дискретна математика", "Лінійна алгебра", "ІПЗ", "ОПАМ"]
].mean(axis=1)

print("Таблиця студентів із середнім балом:\n")
print(df[["Імʼя", "Прізвище", "Середній бал"]])

print("\nСередній бал групи з дисциплін:")

print("Мат. аналіз:", df["Мат.ан."].mean())
print("Дискретна математика:", df["Дискретна математика"].mean())
print("Лінійна алгебра:", df["Лінійна алгебра"].mean())
print("ІПЗ:", df["ІПЗ"].mean())
print("ОПАМ:", df["ОПАМ"].mean())
